# 가장 긴 증가하는 부분 수열
# 
# 문제
# - 수열 A가 주어졌을 때, 가장 긴 증가하는 부분 수열을 구하는 프로그램을 작성하시오.
# - 예를 들어, 수열 A = {10, 20, 10, 30, 20, 50} 인 경우에 가장 긴 증가하는 부분 수열은 A = {10, 20, 10, 30, 20, 50} 이고, 길이는 4이다.
# 입력
# - 첫째 줄에 수열 A의 크기 N (1 ≤ N ≤ 1,000)이 주어진다.
# - 둘째 줄에는 수열 A를 이루고 있는 Ai가 주어진다. (1 ≤ Ai ≤ 1,000)
# 출력
# - 첫째 줄에 수열 A의 가장 긴 증가하는 부분 수열의 길이를 출력한다.

def solution(n, a):
    dp = [1 for _ in range(n)]                                   # 기본 증가 수열 길이를 1로 초기화

    for i in range(n):                                           
        for j in range(i+1):                                     # 현재 위치 이전의 값들을 쭉 비교
            if  a[j]<a[i]:                                       # - 현재 값보다 작은 수열의 갯수를 구함
                dp[i] = max(dp[i], dp[j] + 1)                    # - 현재 값보다 작은 수열의 길이+1로 업데이트
    return max(dp)
     
n = int(input())
a = list(map(int, input().split(" ")))
print(solution(n,a))